public class Main_1 {
    public static void main(String[] args) {

///*
//Арифметика.
//
//Определения:
//Арифметическая операция — сложение, вычитание, умножение и деление.
//
//Оператор — специальный символ, создающий операцию. Например, + создает операцию сложения.
//
//Операнд — объект, который участвует в операции. 3 * 6: здесь 3 и 6 — операнды.
//
//Унарная операция — операция с одним операндом. Например, -3 — унарная операция для получения числа, противоположного числу три.
//
//Бинарная операция — операция с двумя операндами. Например, 3 + 9.
//
//Коммутативность — свойство операции, когда изменения порядка операндов не влияет на результат.
//Например, сложение — коммутативная операция: от перемены мест слагаемых сумма не меняется.
// */
//
//
//
//
//
    }
}

